<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件
use \tp5er\Backup;
  function mybackup(){
		$config=array(
		'path' => './Data/',//数据库备份路径
		'part' => 20971520,//数据库备份卷大小
		'compress' => 0,//数据库备份文件是否启用压缩 0不压缩 1 压缩
		'level' => 9 //数据库备份文件压缩级别 1普通 4 一般 9最高
		);

		$db= new Backup($config);//实例化数据库备份类进行条用里面的方法
		return $db;
	}
